Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: དེ་དག་དགའ་བ་དང་། མོས་པ་དང་། རབ་ཏུ་མགུ་བ་ཐོབ་ནས་རྒྱུད་ཀྱི་སྒྲ་དང་། སིལ་སྙན་གྱི་སྒྲ་དང་། གླུ་དབྱངས་ཀྱི་སྒྲ་དེ་དག་ལས་སངས་རྒྱས་ཀྱི་སྒྲ་འབྱུང་ངོ་། །ཆོས་ཀྱི་སྒྲ་དང་དགེ་འདུན་གྱི་སྒྲ་འབྱུང་ངོ་། །
en: As they become delighted, inspired, and thrilled, the sounds coming from the lute, the instruments, and the songs ring out with the words ‘Buddha,’ ‘Dharma,’ and ‘Saṅgha.’

source: བྱང་ཆུབ་ཀྱི་སེམས་ལ་དགའ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་སེམས་བསྐྱེད་པར་སྦྱོར་བའི་སྒྲ་འབྱུང་ངོ་། །སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱི་སྒྲ་འབྱུང་ངོ་། །བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ཀྱི་སྒྲ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་ཞི་གནས་དང་། ལྷག་མཐོང་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་སྒྲ་འབྱུང་ངོ་། །
en: The words of the joy associated with the mind set on awakening and the generation of the mind directed toward omniscience also appear, as do the words generosity, discipline, patience, diligence, concentration, insight, love, compassion, joy, equanimity, the applications of mindfulness, the relinquishments, the bases of miraculous display, the strengths, the powers, the branches of awakening, the path, tranquility, special insight, the concentrations, the liberations, the absorptions, the attainments, impermanence, suffering, selflessness, emptiness, the absence of marks, the absence of wishes, the absence of formation, the absence of arising, the absence of origination, insubstantiality, the Dharma teachings of the bodhisattvas’ scriptural collection, the dhāraṇīs, the vajra words, the purification of the three spheres, and the turning of the irreversible Dharma wheel.

source: མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པའི་སྒྲ་འབྱུང་ངོ་། །སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། དངོས་པོ་མེད་པའི་སྒྲ་འབྱུང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའ་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་དང་། གཟུངས་དང་རྡོ་རྗེའི་ཚིག་དང་། འཁོར་གསུམ་ཡོངས་སུ་སྦྱོང་བའི་སྒྲ་འབྱུང་ངོ་། །ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བའི་སྒྲ་དང་། ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་གདོན་མི་ཟ་བའི་རྒྱལ་པོའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རྒྱ་མཚོའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ཆོས་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ཆོས་ཐམས་ཅད་ལ་དབང་བྱེད་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རྣམ་པར་བཀོད་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རིན་ཆེན་སྒྲོན་མའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རིན་ཆེན་འབྱུང་གནས་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རིན་ཆེན་བརྩེགས་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ཉོན་མོངས་པ་སྤོང་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། དགའ་བྱེད་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། པད་མ་བཀོད་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། པད་མ་བླ་མའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ནམ་མཁའི་མཛོད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ཐམས་ཅད་ཀྱི་རྗེས་སུ་འགྲོ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། དམ་པའི་ཆོས་པུཎྜ་རཱི་ཀའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ཁྱད་པར་ཅན་གྱི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རྣམ་པར་རྒྱལ་བར་དབང་བྱེད་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ཆེར་བསྒྱིངས་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རྣམ་པ་ལ་སེམས་དབང་བྱེད་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། སེང་གེ་བསྒྱིངས་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ཉི་མ་སྒྲོན་མའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། མཐའ་ཡས་འཁྱིལ་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རྒྱུན་གྱི་རྗེས་སུ་སོང་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རྡོ་རྗེའི་དཀྱིལ་འཁོར་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རྡོ་རྗེའི་རྒྱལ་མཚན་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རྡོ་རྗེ་ལྟེ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ས་འཛིན་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རི་རབ་སྒྲོན་མའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རི་རབ་རྒྱལ་མཚན་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རིན་ཆེན་མཛོད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། སེམས་ལ་དབང་བྱེད་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་རྣམ་པར་ལྟ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། སྤྱོད་པ་ཐམས་ཅད་ཀྱི་ཡུལ་ལས་ངེས་པར་འབྱུང་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ཟབ་མོ་སྦེད་པར་སྦྱོར་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། སྤོབས་པ་སྣ་ཚོགས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། བལྟར་མི་མཐོང་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་ལྟ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། རྣམ་པར་རོལ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། མངོན་པར་ཤེས་པ་ཐམས་ཅད་ལས་ངེས་པར་འབྱུང་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། བདུད་ཀྱི་དཀྱིལ་འཁོར་འཇིག་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། གཟུགས་ཐམས་ཅད་ཀུན་ཏུ་སྟོན་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། སྒྲ་ཐམས་ཅད་ལ་འཇུག་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ལུས་ཐམས་ཅད་རྣམ་པར་གཞིག་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། སྤྱོད་པ་ཐམས་ཅད་ལ་དབང་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ཤེས་རབ་སྒྲོན་མའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ལག་ན་སྒྲོན་མའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། བྱང་ཆུབ་མངོན་སུམ་སྣང་བྱེད་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་འཇུག་པ་སྟོན་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་དང་། ཡོན་ཏན་གྱི་རྣམ་པ་ཐམས་ཅད་ལ་འཇུག་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་འབྱུང་ངོ་། །
en: “Moreover, there also appear the words of the royal absorption that is without doubt concerning all phenomena, the absorption of the oceanic seal, the absorption that fuses with all phenomena, the absorption that controls all phenomena, the absorption of the array, the absorption of the precious lamp, the absorption of the source of jewels, the absorption of the heap of jewels, the absorption of the abandonment of afflictions, the absorption that produces enjoyment, the absorption of the array of lotuses, the absorption of the great lotuses, the absorption of the sky treasury, the all-pervading absorption, the absorption of the white lotus of the sacred Dharma, the extraordinary absorption, the all-victorious absorption, the greatly poised absorption, the absorption of the mind that masters all aspects, the absorption of the poised lion, the absorption of the sun lamp, the absorption of the endless swirl, the absorption that follows the flow, the absorption of the vajra circle, the absorption of the vajra banner, the vajra-like absorption, the absorption of the vajra navel, the earth-holder absorption, the absorption of the lamp of Mount Sumeru, the absorption of the victory banner of Mount Sumeru, the absorption of the precious treasury, the absorption that controls the mind, the absorption that sees the minds of all beings, the absorption that gains mastery over the objects of all forms of conduct, the absorption that connects with what is deeply concealed, the absorption of various types of eloquence, the invisible absorption, the absorption that sees all phenomena, the absorption of enjoyment, the absorption that gains mastery over all higher perceptions, the absorption that destroys the circle of Māra, the absorption that displays all forms, the absorption that penetrates all sounds, the absorption that destroys all bodies, the absorption that controls all forms of conduct, the absorption of the lamp of insight, the absorption of the lamp in the hands, the absorption that illuminates awakening, the absorption that shows the entrance into correct knowledge , and the absorption that engages in all aspects of qualities.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་རྒྱུད་ཀྱི་སྒྲ་དང་། སིལ་སྙན་གྱི་སྒྲ་དང་། གླུ་དབྱངས་ཀྱི་སྒྲ་དེ་དག་ལས་ཆོས་ཀྱི་སྒྲ་འདི་ལྟ་བུ་འདི་དང་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་འབྱུང་ངོ་། །སྒྲ་དེ་དག་གིས་སེམས་ཅན་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་ཏེ།
en: “Noble son, these sounds of the Dharma and these names of absorptions manifest in that way from the sounds of the lute, and those instruments and songs, which ripen those beings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་འདི་ལྟ་བུ་དང་ལྡན་པ་ཡིན་ནོ། །
en: Noble son, such are the amazing and marvelous qualities that bodhisattva great beings possess.”

source: མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་ཡོན་ཏན་བསྔགས་པ་བསྟན་པ་འདི་བཤད་པ་ན།
en: When the Blessed One had proclaimed the praises of the kiṃnara king Druma’s qualities,

source: སངས་རྒྱས་ཀྱི་མཐུས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གྱི་ལག་པར་ལྷའི་མེ་ཏོག་མན་དཱ་རའི་ཕུར་མ་གྲུབ་ནས།
en: through the power of the Buddha divine mandārava flowers materialized in the hands of the entire assembly,

source: དེ་དག་གིས་མེ་ཏོག་གི་ཕུར་མ་དེ་དག་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་ལ་གཏོར་ཏོ། །
en: who then tossed them toward the kiṃnara king Druma.

source: དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་བྱིན་གྱི་རླབས་ཇི་ལྟ་བུས་མེ་ཏོག་དེ་དག་ལག་པ་གཡས་པར་བླངས་ཏེ། མེ་ཏོག་གཅིག་ཀྱང་ས་ལ་མ་ལྟུང་བར་དེ་ལྟ་བུའི་བྱིན་གྱི་རླབས་ཀྱི་བྱིན་གྱིས་བརླབས་ནས་མེ་ཏོག་བླངས་པ་དེ་དག་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་ཏོ། །
en: Then, in accordance with the blessings, the kiṃnara king Druma caught the flowers in his right hand and tossed them toward the Blessed One without letting a single one of them fall to the ground.

source: དེ་ནས་མེ་ཏོག་དེ་དག་གཏོར་མ་ཐག་ཏུ་སངས་རྒྱས་ཀྱི་མཐུས་སྐད་ཅིག་དེ་ལ་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་རིན་པོ་ཆེའི་གདུགས་གཅིག་གིས་ཁེབས་པར་གྱུར་ཏོ། །
en: As soon as he threw those flowers, through the power of the Buddha a parasol made of precious flowers covered this entire chiliocosm.

source: མེ་ཏོག་རིན་པོ་ཆེའི་གདུགས་དེ་ལས་མུ་ཏིག་གི་དོ་ཤལ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་རབ་ཏུ་འཕྱང་ངོ་། །
en: Billions of pearl garlands hung from it, and

source: !མེ་ཏོག་གི་དོ་ཤལ་འཕྱང་བ་རེ་རེ་ལས་ཀྱང་འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་བྱུང་ངོ་། །
en: myriads of light rays radiated from each pearl in those pearl garlands.

source: འོད་ཟེར་ཐམས་ཅད་ཀྱི་རྩེ་མོ་ལས་ཀྱང་པད་མ་སྣ་ཚོགས་བལྟ་ན་སྡུག་པ། ཁ་དོག་དག་དང་ལྡན་པ་དྲི་དང་ལྡན་པ། ཡིད་དུ་འོང་བ་དག་བྱུང་བར་གྱུར་ཏོ། །
en: Various lovely, colorful, fragrant, and delightful lotuses appeared on the tip of every light ray, and

source: པད་མ་ཐམས་ཅད་ལ་ཡང་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཅི་འདྲ་བ་དེ་འདྲ་བའི་དེ་བཞིན་གཤེགས་པའི་སྐུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཤིང་བཞུགས་པར་ཀུན་ཏུ་སྣང་ངོ་། །
en: on top of each of those lotuses thus-gone ones displaying the same physical form as the Blessed One Śākyamuni appeared, sitting cross-legged.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ།
en: All those blessed buddhas gave their approval to the kiṃnara king Druma.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་སེམས་ཅན་མང་པོ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: They said, “Sublime being, you have ripened many beings.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་གང་ཡུལ་ལས་རྣམ་པར་གྲོལ་ཡང་ཡུལ་ཐམས་ཅད་ཀྱང་སྟོན།
en: Although you are free from all domains, you manifest in all of them to ripen sentient beings.

source: འཁོར་བ་ལས་གྲོལ་ཡང་བསམས་བཞིན་དུ་སྲིད་པར་སྐྱེ་བ་ཀུན་ཏུ་སྟོན།
en: Although you are free from saṃsāra, you intentionally display rebirth within existence.

source: མྱ་ངན་ལས་འདས་པའི་སྐྱོན་མེད་པ་ཐོབ་ཀྱང་། ཁམས་གསུམ་ན་ཉེ་བར་སྤྱོད་པ་འདི་ལྟ་བུ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བྱ་བ་ཡིན་ཏེ། ལེགས་སོ་ལེགས་སོ། །
en: Although you have reached faultless nirvāṇa, you partake in the three realms. Such bodhisattva activities are excellent, excellent!”

source: དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The kiṃnara king Druma then formed the resolve,

source: བདག་གིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་དབུ་ལ་རིན་པོ་ཆེའི་གདུགས་གཞན་དག་བྱིན་གྱིས་བརླབ་པོ་སྙམ་མོ། །
en: “I will manifest other bejeweled parasols to cover the heads of all those thus-gone ones!”

source: དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་དེའི་ཚེ་རིན་པོ་ཆེའི་གདུགས་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: At that moment, the kiṃnara king Druma entered the absorption called the array of bejeweled parasols .

source: མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་རིན་པོ་ཆེའི་གདུགས་བཀོད་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ། དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དབུའི་ཐད་དྲང་གི་སྟེང་ན་རིན་པོ་ཆེའི་གདུགས་རྣམས་གནས་པར་ཀུན་ཏུ་སྣང་ངོ་། །
en: As soon as he had entered this absorption, bejeweled parasols manifested right above the head of each thus-gone one.

source: འཁོར་དེར་ཐམས་ཅད་ཀྱི་ལག་པ་གཡས་པ་ནས་ཀྱང་རིན་པོ་ཆེའི་གདུགས་རྣམས་བྱུང་བར་གྱུར་ཏེ
en: Bejeweled parasols also appeared in the right hands of each member of the assembly, and

source: དེ་དག་གིས་རིན་པོ་ཆེའི་གདུགས་དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་མངོན་པར་བཀབ་བོ།། །།
en: they used them to shelter those blessed buddhas.

source: མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The kiṃnara king Druma then thought,

source: འདི་ལྟར་བདག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཉན་ཐོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་བཅས་པར་བཤོས་ལ་སྤྱན་དྲངས་ཏེ།
en: “I will invite the Blessed One, the thus-gone one, the Buddha Śākyamuni, with his saṅgha of hearers and his saṅgha of bodhisattvas, for a meal.

source: འདི་ལྟར་བདག་གིས་བཅོམ་ལྡན་འདས་འཁོར་དང་བཅས་པར་རིའི་རྒྱལ་པོ་སྤོས་ཀྱི་ངད་ལྡང་དུ་བདག་གི་གནས་སུ་གཤེགས་པར་གསོལ་ཏོ། །
en: I will supplicate the Blessed One and his retinue to come to my land at the majestic Mount Gandhamādana,

source: དེ་ལྟར་ན་བདག་གི་གནས་ཡོངས་སུ་སྤྱད་པར་འགྱུར་རོ། །
en: to enjoy my abode and

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་ཚོགས་ཚད་མེད་པ་ལ་ཕན་བཏགས་པར་ཡང་འགྱུར་རོ། །
en: benefit countless gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kiṃnaras, and mahoragas.

source: དེ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བྱ་བ་དང་། ཡོངས་སུ་སྤྱད་པར་བྱ་བར་སྤྲོ་བར་འགྱུར་ཏེ།
en: They will enthusiastically venerate and serve the Blessed One, and

source: དེའི་ཕྱིར་དེ་དག་གི་ཡུན་རིང་པོའི་དོན་དང་ཕན་པ་དང་། གྲུབ་པ་དང་། བདེ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསྒྲུབ་པ་འཐོབ་པར་འགྱུར་རོ་སྙམ་མོ། །
en: they will thereby gain long-term benefit, welfare, success, happiness, and bodhisattva accomplishment.”

source: དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The kiṃnara king Druma prostrated to the feet of the Blessed One, joined the palms of his hands, and said,

source: བཅོམ་ལྡན་འདས་བདག་ལ་ཐུགས་བརྩེ་བ་དང་། སེམས་ཅན་ཚད་མ་མཆིས་པའི་དགེ་བའི་རྩ་བ་སྤེལ་བའི་སླད་དུ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་རི་སྤོས་ཀྱི་ངད་ལྡང་གི་ངོས་ལ་བདག་གི་གནས་སུ་དགུང་བདུན་ཞིག་བཞུགས་པར་བདག་ལ་གནང་བར་མཛད་དུ་གསོལ། །
en: “Blessed One, out of love for me and in order to increase the roots of virtue of countless beings, I supplicate the Thus-Gone One, the worthy one, the perfect Buddha to agree to remain for seven days in my abode on the slope of Mount Gandhamādana with his saṅgha of bodhisattvas and his saṅgha of hearers.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་དེ་བཞིན་གཤེགས་པའི་འཁོར་དང་བཅས་པ་ལ་བསྙེན་བཀུར་དང་ཡོངས་སུ་སྤྱད་པར་བགྱི་བར་སྤྲོའོ། །
en: Blessed One, we would be delighted to venerate and serve the Thus-Gone One and his retinue!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་ཀྱི་ཚོགས་དང་བཅས་པ་ལ་ཞག་བདུན་རི་སྤོས་ཀྱི་ངད་ལྡང་གི་ངོས་ལ་བཞུག་པར་གནང་ངོ་། །
en: Out of love for the kiṃnara king Druma, the Blessed One agreed to remain for seven days on the slope of Mount Gandhamādana with his assemblies of bodhisattvas and hearers.

source: དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་བཅོམ་ལྡན་འདས་ཀྱིས་གནང་བར་རིག་ནས།
en: When the kiṃnara king Druma saw that the Blessed One had accepted his request,

source: ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ་
en: he became satisfied, cheerful, thrilled, and elated.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་དཔུང་དང་བཅས་གཡོག་འཁོར་དང་བཅས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: With joy and happiness filling his mind, he and his subjects and servants prostrated to the feet of the Blessed One, and circumambulated him three times.

source: སིལ་སྙན་དང་རོལ་མོའི་དབྱངས་སྒྲ་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ཏེ། འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་ནས་སོང་ནས་རིའི་རྒྱལ་པོ་སྤོས་ཀྱི་ངད་ལྡང་བ་ལ་གནས་སོ། །
en: They worshiped the Blessed One with musical melodies and then left the assembly, departing for the majestic Mount Gandhamādana.

source: དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་རང་གི་ཁྱིམ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་ཏེ།
en: Then, as an act of worship for the Blessed One, the kiṃnara king Druma decorated his home with all sorts of ornaments.

source: འཁོར་གྱི་ཁྱམས་རྒྱར་ཀུན་ནས་དཔག་ཚད་ལྔ་བརྒྱ་པ། (བཻདཱུརྱ་,བཻ་ཌཱུརྱ་)སྔོན་པོ་དང་། འཛམ་བུའི་ཀླུང་གི་གསེར་གྱི་པད་མས་ལེགས་པར་བརྒྱན་པ། རིན་པོ་ཆེ་དུ་མས་རྣམ་པར་སྤྲས་པ་བྱས་སོ། །
en: He adorned the five hundred leagues of his vast courtyard with blue beryl stones and with lotuses made of gold from the Jambū River, and he beautified it with a variety of other precious substances.

source: འཁོར་གྱི་ཁྱམས་དེར་གདན་ཁྲི་རྩ་བ་རིན་པོ་ཆེ་ལས་བྱས་པ། ལྷའི་རས་བརྒྱ་སྟོང་བཏིང་བ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་བཤམས་སོ། །
en: In that courtyard, he arranged on foundations made of precious substances many hundreds of thousands of seats on which a hundred thousand divine fabrics were spread.

source: བཅོམ་ལྡན་འདས་ཀྱི་གདན་སེང་གེའི་ཁྲི་འཕང་དུ་དཔག་ཚད་བཅུ་གཉིས་པ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་སྤྲས་པ། རིན་པོ་ཆེའི་ཁ་ཁྱེར་གྱིས་བསྐོར་བ། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་བ། སྙིང་པོ་མཆོག་གི་བདུག་པས་བདུགས་པ། བླ་རེ་བྲེས་པ། དར་གྱི་ལྡ་ལྡི་མང་པོ་བྲེས་པ་ལྷའི་མེ་ཏོག་གཏོར་བ་བཤམས་སོ། །
en: He also prepared a lion throne for the Blessed One, which was twelve leagues high. It was adorned with all types of precious substances and was surrounded by jeweled stands that supported parasols, banners, and flags. It was perfumed with the finest incense, covered by a canopy, decorated with many silken streamers, and strewn with divine flowers.

source: སེང་གེའི་ཁྲི་དེའི་ཕྱོགས་བཞིར་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་སྣ་ཚོགས་བལྟ་ན་སྡུག་པ་བཞི་སྤྲུལ་ཏེ།
en: In the four directions around this lion throne, he emanated four groups of splendid precious trees.

source: སྐྱེ་བོ་ཐམས་ཅད་བསྡུས་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: He then assembled all his subjects and uttered these verses:

source: ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་ཇི་བཞིན་དུ། །སངས་རྒྱས་འབྱུང་བ་བརྒྱ་ལམ་རྙེད་འགྱུར་བ། །མི་མཆོག་དེ་ནི་ད་ལྟར་བྱུང་གྱུར་གྱིས། །སྐྱོབ་ལ་གུས་དང་བཅས་པས་མཆོད་པ་གྱིས། །
en: “Just like an uḍumbara flower, It is extremely rare for a Buddha to appear. That foremost of humans has now come; Worship the Protector with reverence!

source: ང་རྒྱལ་དག་དང་རྒྱགས་དང་གཡོ་སྤོངས་ལ། །ཕྲག་དོག་སེར་སྣ་དེ་བཞིན་སྒྱུ་རྣམས་དང་། །རྒོད་པ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་བྱོས་ལ། །སྟོན་ལ་གུས་དང་བཅས་པས་མཆོད་པ་གྱིས། །
en: “Give up pride, haughtiness, dishonesty, Envy, stinginess, deceit, And all forms of agitation, And worship the Teacher with reverence!

source: སྤོས་ངད་ལྡང་བ་འདི་ན་ལྷ་ཡུལ་བའི། །མེ་ཏོག་ཁྱད་པར་འཕགས་པ་ཇི་སྙེད་པ། །དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས་ནས་སུ། །སྐྱེས་བུ་ཁྱུ་མཆོག་ལ་ནི་མཆོད་པ་གྱིས། །
en: “Gather all the extraordinary flowers You can find in this divine land Of Gandhamādana And offer them to the supreme among humans!

source: སེམས་ཅན་མཆོག་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར། །དྲི་ཞིམ་ཡིད་འོང་ཁྱད་པར་འཕགས་པའི་དྲི། །དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་ཙན་དན་གྱིས། །སྤོས་ཀྱི་ངད་ལྡང་འདི་ལ་བདུག་པ་གྱིས། །
en: “To worship the supreme being, Perfume Gandhamādana With extraordinary, sweet-smelling fragrances, And with yellow sandalwood!

source: གླུ་དབྱངས་སིལ་སྙན་རྣམ་མང་ཡིད་འོང་བ། །མིའམ་ཅི་དག་རྟག་རྩེན་གར་བྱེད་པ། །ལྡན་པར་བྱོས་ལ་དགའ་ཞིང་དང་བ་ཡིས། །རྐང་གཉིས་མཆོག་ལ་མཆོད་པ་རབ་ཏུ་གྱིས། །
en: “Kiṃnaras, worship the foremost of humans With delight and faith, Always playing and dancing, And offering many delightful melodies of song and music!

source: མཚུངས་པ་མེད་པ་མཐོང་བ་རྙེད་དཀའ་བ། །དེ་བཞིན་གཤེགས་ལ་ལྷ་ཡི་གདུགས་རྣམས་དང་། །བ་དན་དག་དང་རྒྱལ་མཚན་ཆོས་གོས་དང་། །བླ་རེ་མང་པོ་ཡིད་འོང་གཟུང་བར་བྱོས། །
en: “Carry a lot of magnificent divine parasols, flags, Banners, Dharma robes, and canopies To welcome the Thus-Gone One— Peerless and so difficult to behold!

source: སངས་རྒྱས་མཆོད་པས་བདེ་འགྲོར་འགྲོ་བར་འགྱུར། །བརྒྱ་བྱིན་དང་ནི་འཇིག་རྟེན་སྐྱོང་བར་འགྱུར། །ཚངས་པ་དག་དང་དབང་བྱེད་དབང་ཕྱུག་དང་། །ལྷ་དང་མི་ཡི་བདག་པོ་ཆེན་པོར་འགྱུར། །
en: “By worshiping the Buddha, you will be reborn Into the happy states of existence, As Śakra, the protectors of the world, Brahmā, the lord Īśvara, Or great rulers of gods and humans.

source: མི་མཆོག་མཆོད་པས་གཟུགས་དང་ཁ་དོག་དང་། །གྲགས་དང་བརྗོད་དང་འཁོར་དང་ལོངས་སྤྱོད་དང་། །དེ་བཞིན་དབང་ཕྱུག་དང་ནི་སྙན་ཚིག་དང་། །དེ་བཞིན་གཟུང་བར་འོས་པའི་ཚིག་ཏུ་འགྱུར། །
en: “By worshiping the foremost of humans you will be blessed With good looks and complexion, and with fame and praise; You will enjoy retinues, material possessions, ruling power, And you will speak with pleasant and persuasive words.

source: གང་དག་འདིར་ནི་ལྷ་དང་དེ་བཞིན་དུ། །མི་རྣམས་ཀྱི་ནི་འདུས་བྱས་བདེ་བ་དང་། །བདེ་བ་བདེ་བས་ཚིམ་པར་འདོད་པ་རྣམས། །འཇིག་རྟེན་མགོན་པོ་དེ་ལ་མཆོད་པ་གྱིས། །
en: “Those who wish to experience here The conditioned pleasures of gods and humans, And those who wish to be filled with happiness Should worship this protector of the world!

source: རང་རྒྱལ་བྱང་ཆུབ་དེ་བཞིན་ཉན་ཐོས་དང་། །དེ་ལྟར་དམ་པ་མཆོག་གི་ཐེག་པ་དང་། །བདུད་ཀྱི་དཔུང་རྣམས་རབ་འཇོམས་གང་འདོད་པས། །སེམས་ཅན་མཆོག་དེ་ལ་ནི་མཆོད་པ་གྱིས། །
en: “Those who wish for the awakening of the solitary buddhas And the hearers, or for the sacred and supreme vehicle, And those who wish to defeat the hordes of Māra Should worship this supreme being!”

source: དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་རང་གི་གཡོག་འཁོར་ཐམས་ཅད་ལ་གོ་བར་བྱས་ཏེ
en: After the kiṃnara king Druma had instructed all his servants and subjects in that way,

source: མེ་ཏོག་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་བསྔོགས་ནས་རོ་བརྒྱ་པའི་ཞལ་ཟས་བཤམས་ཏེ།
en: they gathered flowers, fragrant substances, garlands, and ointments, and prepared delicious food.

source: རིའི་རྒྱལ་པོ་སྤོས་ཀྱི་ངད་ལྡང་གི་ལྷོ་ཕྱོགས་ཀྱི་ངོས་ལ་འདུག་ནས་སིལ་སྙན་དང་གླུ་དབྱངས་བླངས་ཏེ།
en: Then, they gathered on the southern slope of the majestic Mount Gandhamādana and started playing music and singing songs.

source: རྒྱུད་ཀྱི་སྒྲ་དང་གླུའི་སྒྲ་དང་ལྡན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་དབྱངས་ལས་ཚིགས་སུ་བཅད་དེ། བཅོམ་ལྡན་འདས་ལ་དུས་བསྐུལ་བ།
en: In poetry accompanied by singing and the playing of lutes, they invoked the Blessed One with these melodious verses:

source: ཕན་པ་མཛད་ཅིང་བདེ་མཛད་དགའ་མཛད་བཅོམ་ལྡན་འདས། །ཞལ་ཡང་རབ་འཛུམ་ཟླ་བའི་ངོས་ལྟར་དྲི་མི་མངའ། །སྐྱེ་མཆོག་དགེ་སྦྱོང་དམ་པ་ལྷ་དང་མིས་མཆོད་པ། །བདེ་བར་གཤེགས་ཁྱོད་འདིར་གཤེགས་པ་ཡི་དུས་འདི་ལགས། །
en: “Benefactor, provider of happiness and joy, Blessed One— With a smiling face immaculate like the moon, Supreme being, sublime practitioner worshiped by gods and humans— Blissful One, it is time for you to arrive here!

source: !སྟོབས་བཅུ་རྣམས་ཀྱི་སྟོབས་མངའ་ཕ་རོལ་དཔུང་འཇོམས་པ། །གཞན་གྱི་ཚོགས་རྣམས་འཇོམས་ཤིང་འགྲོ་ལ་ཕན་པ་མཛད། །འཇོ་དང་རྙོག་པ་རྣམས་དང་དྲི་མ་ཐ་སྤངས་པ། །ཕན་པ་མཛད་པ་ཁྱོད་འདིར་གཤེགས་པའི་དུས་འདི་ལགས། །
en: “Possessor of the might of the ten powers, conqueror of all hostile armies, Vanquisher of hosts of enemies, benefactor of beings, Undisturbed and unsullied, you have abandoned all stains and harshness; Benefactor, it is time for you to arrive here!

source: སྦྱངས་པའི་ཡོན་ཏན་རྡུལ་སྦྱངས་ཐེ་ཚོམ་རྣམ་པར་གཏོར། །
en: “You observe the ascetic practices, purify stains, and eliminate all doubts, And

source: དྲན་དང་བློ་གྲོས་བློ་ཡངས་མོས་རྟོགས་བློ་གྲོས་ལྡན། །
en: you are mindful, intelligent, generous, resolute, realized, and wise.

source: འགྲོ་རྒྱལ་རྟག་ཏུ་འགྲོ་བ་འགྲོ་མེད་འགྲོ་བ་སྤངས། །
en: King of beings, you are forever beyond existence and have abandoned existence, Yet

source: ཕན་པ་མཛད་ཅིང་དགའ་མཛད་རབ་ཏུ་དགྱེས་པའི་ཐུགས། །
en: you benefit others, please them, and have a joyful mind.

source: ཉི་མ་ཟླ་བ་ནོར་བུ་གློག་རྣམས་མཛེས་པའི་འོད། །བརྒྱ་བྱིན་ཚངས་པ་སྲིད་གསུམ་ལྷ་ཚོགས་འོད་འཕྲོག་ཅིང་། །
en: “You outshine the beautiful light of the sun, the moon, jewels, and lightning, As well as the light emitted by Śakra, Brahmā, and all the gods of the three realms.

source: !འོད་མཛད་དཔལ་སྟུག་ཐུབ་ཁྱོད་འོད་ནི་ཕན་བགྱིད་པས། །འོད་འདི་བསལ་ནས་རྒྱལ་བའི་འོད་ནི་ལྷག་གེ་ཡི། །
en: Sage, your splendorous and bright light benefits others, And so, Victorious One, you are radiant with your brilliant light..

source: ཁྱོད་ཀྱི་ལྷ་སྐད་ཀླུ་སྐད་མི་ཅིའི་གླུ་སྒྲ་ཡིས། །ཡང་དང་ཡང་དུ་འབར་བའི་ཉོན་མོངས་ཞི་བར་བགྱིད། །
en: “With your divine voice, nāga voice, and kiṃnara songs, You pacify the blazing afflictions again and again.

source: སྐད་མཆོག་ཡངས་པ་ཚངས་པ་རྣམས་ཀྱི་སྒྲ་སྐད་ཀྱིས། །ཉོན་མོངས་ཐམས་ཅད་ཞི་བར་བགྱིད་པས་འབར་མ་ལགས། །
en: Your Brahmā voice—supreme and deep— Pacifies all afflictions by extinguishing their fire.

source: སྨན་པ་གང་དག་ཕྱོགས་བཅུར་རྒྱུ་ཡང་དེ་དག་གིས། །གང་དུའང་འགྲོ་བའི་ཉོན་མོངས་ཞི་བར་བགྱིད་མི་ནུས། །
en: “Even doctors who roam throughout the ten directions Could not pacify the afflictions wherever they occur.

source: སྨན་པའི་རྒྱལ་པོ་བླ་མེད་གང་ཚེ་གསུང་བརྗོད་པ། །དེ་ཚེ་ཉོན་མོངས་ཀུན་ཞི་བདེ་བ་ཐམས་ཅད་སྦྱིན། །
en: Yet when you, unsurpassed king of doctors, proclaim your words, All afflictions are pacified and all forms of happiness are granted.
